ajohnson-smarthome/AJMiddleCar/firmware/p4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# This module carries an EARLY ESP32-P4: silicon revision v1.3, not the v3.x that IDF 6.0
# defaults to. ESP-IDF treats the two families as mutually exclusive — selecting <3.0 caps the
# supported range at v1.99 and rules out every v3.x chip, and vice versa. Without these two
# lines the image is built for [v3.1..v3.99] and flashing stops with
# "requires chip revision in range [v3.1 - v3.99] (this chip is revision v1.3)".
# If this project ever moves to a v3.x board, both lines come out again.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Console: main.c's `mix <t> <y>` REPL reads USB Serial JTAG directly (no UART VFS).
# The board exposes two Type-C ports; which one carries the JTAG console is confirmed at
# bring-up (docs/bringup.md).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_HTTPD_WS_SUPPORT=y

# 16 MB flash with a custom table: two 4 MB OTA slots plus a reserved data partition.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# The module stacks 32 MB PSRAM. Feature parity needs none of it, but inheriting whatever
# the target defaults to is not a decision — it is enabled deliberately, with nothing
# allocated there yet.
CONFIG_SPIRAM=y

# --- Radio: WiFi lives on the on-board ESP32-C6, reached over SDIO -------------------------
# esp_hosted picks these by default for a P4 host with a C6 co-processor, but they are pinned
# here because they are wiring, not preference: a component update that moved them would break
# the radio silently. They also reserve GPIOs — see board.h before assigning any new pin.
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=40000
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
